IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            SELECT INFILE ASSIGN TO 'input/Dec1Input.txt'
                ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
    FILE SECTION.
        FD INFILE.
        01 INPUT-REC.
           05 A-SIDE PIC 9(1).
           05 FILLER PIC X(3).
           05 B-SIDE PIC 9(1).

    WORKING-STORAGE SECTION.
        01 ARR-A OCCURS 100 TIMES.
           05 A PIC 9(5).
        01 ARR-B OCCURS 100 TIMES.
           05 B PIC 9(5).
        01 IND PIC 9(9) VALUE 1.
        01 N PIC 9(9).
        01 EOF PIC A(1).

PROCEDURE DIVISION.
    OPEN INPUT INFILE.
    PERFORM READ-NUMS UNTIL EOF = 'Y'.
    COMPUTE N = IND - 1
    PERFORM PRINT-NUMS
    CLOSE INFILE
    STOP RUN.

    READ-NUMS.
       READ INFILE
           AT END MOVE 'Y' TO EOF
           NOT AT END PERFORM STORE-NUMS
       END-READ.

    STORE-NUMS.
       MOVE A-SIDE TO ARR-A(IND)
       MOVE B-SIDE TO ARR-B(IND)
       COMPUTE IND = IND + 1.

    PRINT-NUMS.
       SORT ARR-A ON DESCENDING KEY A
       SORT ARR-B ON DESCENDING KEY B
       PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > N
           DISPLAY ARR-A(IND)
           DISPLAY ARR-B(IND)
           DISPLAY ' '
       END-PERFORM.
       